In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame(
    {
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'id':[1,6,9,3]
    }
)
df

      name  age  id
0  harshit   22   1
1     hari   23   6
2    rahul   24   9
3     riya   21   3

In [3]:
df={
    
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'id':[1,6,9,3]
    }

d=pd.DataFrame(df)
d

      name  age  id
0  harshit   22   1
1     hari   23   6
2    rahul   24   9
3     riya   21   3

In [4]:
import numpy as np
df=pd.Series(np.array([1,2,3,4,5]))
df

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
a=pd.Series(50,index=['a','b','c','d'])
a

a    50
b    50
c    50
d    50
dtype: int64

In [6]:
l=[1,2,3,4,5,6,7,8,9,10]
a=pd.Series(l,index=['a','b','c','d',5,6,7,8,9,10])
a.head()
a.tail()

6      6
7      7
8      8
9      9
10    10
dtype: int64

In [7]:
df=pd.DataFrame(
    {
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'id':[1,6,9,3]
    }
)
df.describe()

             age    id
count   4.000000  4.00
mean   22.500000  4.75
std     1.290994  3.50
min    21.000000  1.00
25%    21.750000  2.50
50%    22.500000  4.50
75%    23.250000  6.75
max    24.000000  9.00

In [8]:
df=pd.DataFrame(
    {
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'id':[1,6,9,3]
    }
)
df.columns

Index(['name', 'age', 'id'], dtype='object')

In [9]:
df=pd.DataFrame(
    {
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'id':[1,6,9,3]
    }
)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int64
 2   id      4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [10]:
df=pd.DataFrame(
    {
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'id':[1,6,9,3]
    }
)
df.size

12

In [11]:
df=pd.DataFrame(
    {
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'id':[1,6,9,3]
    }
)
df.shape

(4, 3)

In [12]:
df=pd.DataFrame(
    {
        'name':['harshit','hari','rahul','riya','hari'],
        'age':[22,23,24,21,23],
        'id':[1,6,9,3,6]
    }
)
df.drop_duplicates()

      name  age  id
0  harshit   22   1
1     hari   23   6
2    rahul   24   9
3     riya   21   3

In [13]:
df=pd.DataFrame(
    {
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'id':[1,6,9,3]
    }
)
print(df[['name','age']].shape)

(4, 2)

In [14]:
df=pd.DataFrame(
    {
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'id':[1,6,9,3]
    }
)
df['name']

0    harshit
1       hari
2      rahul
3       riya
Name: name, dtype: object

In [15]:
df=pd.DataFrame(
    {
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'id':[1,6,9,3]
    }
)
df['age']>22

0    False
1     True
2     True
3    False
Name: age, dtype: bool

In [16]:
df[df['age'].isin([22,23])]

      name  age  id
0  harshit   22   1
1     hari   23   6

In [17]:
df=pd.DataFrame(
    {
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'id':[1,6,9,3]
    }
)
df[df['name']=='riya']

   name  age  id
3  riya   21   3

In [18]:
df=pd.DataFrame(
    {
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'id':[1,6,9,3]
    }
)

dd=df.rename(
    columns={
        'id':'identity'
    }
)
dd

      name  age  identity
0  harshit   22         1
1     hari   23         6
2    rahul   24         9
3     riya   21         3

In [19]:
df=pd.DataFrame(
    {
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'id':[1,6,9,3]
    }
)
# df['age'].min()
# df['age'].max()
# df['age'].median()
# df['age'].mode()
# df['age'].std()
# df['age'].mean()

df.agg({'age':['min','max','mean']})

       age
min   21.0
max   24.0
mean  22.5

In [20]:
import pandas as pd

In [21]:
df={
    
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'id':[1,6,9,3],
        'post':["clerk","clerk","cashier","hr"],
        'salary':[20000,25000,30000,35000]

    }

d=pd.DataFrame(df)
d

      name  age  id     post  salary
0  harshit   22   1    clerk   20000
1     hari   23   6    clerk   25000
2    rahul   24   9  cashier   30000
3     riya   21   3       hr   35000

In [22]:
df={
    
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'id':[1,6,9,3],
        'post':["clerk","clerk","cashier","hr"],
        'salary':[20000,25000,30000,35000]

    }

d=pd.DataFrame(df)
d.describe()

             age    id        salary
count   4.000000  4.00      4.000000
mean   22.500000  4.75  27500.000000
std     1.290994  3.50   6454.972244
min    21.000000  1.00  20000.000000
25%    21.750000  2.50  23750.000000
50%    22.500000  4.50  27500.000000
75%    23.250000  6.75  31250.000000
max    24.000000  9.00  35000.000000

In [23]:
df={
    
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'id':[1,6,9,3],
        'post':["clerk","clerk","cashier","hr"],
        'salary':[20000,25000,30000,35000]

    }

d=pd.DataFrame(df)
d.columns

Index(['name', 'age', 'id', 'post', 'salary'], dtype='object')

In [24]:
df={
    
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'id':[1,6,9,3],
        'post':["clerk","clerk","cashier","hr"],
        'salary':[20000,25000,30000,35000]

    }

d=pd.DataFrame(df)
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int64
 2   id      4 non-null      int64
 3   post    4 non-null      object
 4   salary  4 non-null      int64
dtypes: int64(3), object(2)
memory usage: 292.0+ bytes

In [25]:
df={
    
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'id':[1,6,9,3],
        'post':["clerk","clerk","cashier","hr"],
        'salary':[20000,25000,30000,35000]

    }

d=pd.DataFrame(df)
d.size

20

In [26]:
df={
    
        'name':['harshit','hari','rahul','hari'],
        'age':[22,23,24,22],
        'id':[1,6,9,6],
        'post':["clerk","clerk","cashier","clerk"],
        'salary':[20000,25000,30000,20000]

    }

d=pd.DataFrame(df)
d.shape

(4, 5)

In [27]:
df={
    
        'name':['harshit','hari','rahul','hari'],
        'age':[22,23,24,23],
        'id':[1,6,9,6],
        'post':["clerk","clerk","cashier","clerk"],
        'salary':[20000,25000,30000,25000]

    }

d=pd.DataFrame(df)
d.drop_duplicates()

      name  age  id     post  salary
0  harshit   22   1    clerk   20000
1     hari   23   6    clerk   25000
2    rahul   24   9  cashier   30000

In [28]:
df={
    
        'name':['harshit','hari','rahul','hari'],
        'age':[22,23,24,22],
        'id':[1,6,9,6],
        'post':["clerk","clerk","cashier","clerk"],
        'salary':[20000,25000,30000,20000]

    }

d=pd.DataFrame(df)
print(d[["name","salary"]].shape)

(4, 2)

In [29]:
df={
    
        'name':['harshit','hari','rahul','hari'],
        'age':[22,23,24,22],
        'id':[1,6,9,6],
        'post':["clerk","clerk","cashier","clerk"],
        'salary':[20000,25000,30000,20000]

    }

d=pd.DataFrame(df)
d[d["salary"]>22000]

    name  age  id     post  salary
1   hari   23   6    clerk   25000
2  rahul   24   9  cashier   30000

In [30]:
df={
    
        'name':['harshit','hari','rahul','hari'],
        'age':[22,23,24,22],
        'id':[1,6,9,6],
        'post':["clerk","clerk","cashier","clerk"],
        'salary':[20000,25000,30000,20000]

    }

d=pd.DataFrame(df)
d[d["name"]=="hari"]

   name  age  id   post  salary
1  hari   23   6  clerk   25000
3  hari   22   6  clerk   20000

In [31]:
df={
    
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'id':[1,6,9,3],
        'post':["clerk","clerk","cashier","hr"],
        'salary':[20000,25000,30000,35000]

    }

d=pd.DataFrame(df)
a=d.rename(
    columns={
        "salary":"paycheck"
    }
)
a

      name  age  id     post  paycheck
0  harshit   22   1    clerk     20000
1     hari   23   6    clerk     25000
2    rahul   24   9  cashier     30000
3     riya   21   3       hr     35000

In [32]:
df={
    
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'id':[1,6,9,3],
        'post':["clerk","clerk","cashier","hr"],
        'salary':[20000,25000,30000,35000]

    }

d=pd.DataFrame(df)
d.agg({"salary":{"min","max"}})

     salary
max   35000
min   20000

In [33]:
import pandas as pd
df={
    
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'id':[1,6,9,3],
        'post':["clerk","clerk","cashier","hr"],
        'salary':[20000,25000,30000,35000]

    }

d=pd.DataFrame(df)
print('===', d.index)

=== RangeIndex(start=0, stop=4, step=1)

In [34]:
import pandas as pd
df={
    
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'id':[1,6,9,3],
        'post':["clerk","clerk","cashier","hr"],
        'salary':[20000,25000,30000,35000]

    }

d=pd.DataFrame(df)
# d.loc[1]
# d.loc[1:3]
# print(d.loc[d['name']=='hari'])
# print(d.loc[1:3,['name']])
# print(d.loc[1:3,['salary']])
# print(d.loc[1:3,['name','age']])
# d.loc[d["name"]=="riya","salary"]=50000
# d

# d.loc[d["id"]==9,"age"]=30
# d

In [35]:
import pandas as pd
df={
    
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'id':[1,6,9,3],
        'post':["clerk","clerk","cashier","hr"],
        'salary':[20000,25000,30000,35000]

    }

d=pd.DataFrame(df)
# d.iloc[0]
#d.iloc[1:3]
#d.iloc[3,0]
#d.iloc[3,2]
d.iloc[0:3,2]
# d.iloc[3,4]=50000
# d

0    1
1    6
2    9
Name: id, dtype: int64

In [36]:
import pandas as pd
df={
    
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'exp':[1,2,3,4],
        'post':["clerk","clerk","cashier","hr"],
        'salary':[20000,25000,30000,35000]

    }

d=pd.DataFrame(df)
d['bonus']=d.loc[(d['exp']>2),'salary']*0.05
d["total salary"]=d["salary"]+d["bonus"]
#d['total salery']=d.loc[(d['exp']<2),'salary']
d

      name  age  exp     post  salary   bonus  total salary
0  harshit   22    1    clerk   20000     NaN           NaN
1     hari   23    2    clerk   25000     NaN           NaN
2    rahul   24    3  cashier   30000  1500.0       31500.0
3     riya   21    4       hr   35000  1750.0       36750.0

In [37]:
import pandas as pd
df={
    
        'name':['harshit','hari','rahul','riya','rashmi','rakesh'],
        "gender":["male","male","male","female",'female','others']

        
    }

d=pd.DataFrame(df)
d['gender'].value_counts()

gender
male      3
female    2
others    1
Name: count, dtype: int64

In [38]:
import pandas as pd
df={
    
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'exp':[1,2,3,4],
        'post':["clerk","clerk","cashier","hr"],
        'salary':[20000,25000,30000,35000]

    }

d=pd.DataFrame(df)
d['new age']=d['age']+(2)
d

      name  age  exp     post  salary  new age
0  harshit   22    1    clerk   20000       24
1     hari   23    2    clerk   25000       25
2    rahul   24    3  cashier   30000       26
3     riya   21    4       hr   35000       23

In [39]:
import pandas as pd
df={
    
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'exp':[1,2,3,4],
       

    }

d=pd.DataFrame(df)

df1={

        "company":["google","infosys",'excel',"techadd"],
        'post':["clerk","clerk","cashier","hr"],
        'salary':[20000,25000,30000,35000],

}

f=pd.DataFrame(df1)



pd.concat([d,f])

#pd.concat([d,f],keys=['first','second'])
#pd.concat([d,f],keys=['first','second'],axis=1)

      name   age  exp  company     post   salary
0  harshit  22.0  1.0      NaN      NaN      NaN
1     hari  23.0  2.0      NaN      NaN      NaN
2    rahul  24.0  3.0      NaN      NaN      NaN
3     riya  21.0  4.0      NaN      NaN      NaN
0      NaN   NaN  NaN   google    clerk  20000.0
1      NaN   NaN  NaN  infosys    clerk  25000.0
2      NaN   NaN  NaN    excel  cashier  30000.0
3      NaN   NaN  NaN  techadd       hr  35000.0

In [40]:
d=pd.DataFrame(
    {
        
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'exp':[1,2,3,4],
       
    }
)

f=pd.DataFrame(
    {
         "company":["google","infosys",'excel',"techadd"],
        'post':["clerk","clerk","cashier","hr"],
        'salary':[20000,25000,30000,35000],

    }
)
pd.concat([d,f],keys=['first','second'])

             name   age  exp  company     post   salary
first  0  harshit  22.0  1.0      NaN      NaN      NaN
       1     hari  23.0  2.0      NaN      NaN      NaN
       2    rahul  24.0  3.0      NaN      NaN      NaN
       3     riya  21.0  4.0      NaN      NaN      NaN
second 0      NaN   NaN  NaN   google    clerk  20000.0
       1      NaN   NaN  NaN  infosys    clerk  25000.0
       2      NaN   NaN  NaN    excel  cashier  30000.0
       3      NaN   NaN  NaN  techadd       hr  35000.0

In [41]:
#_______________________________________task_(IMP)_____________________________________________________

In [42]:
import pandas as pd
df={
    
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'exp':[1,2,3,4],
        'post':["clerk","clerk","cashier","hr"],
        'salary':[20000,25000,30000,35000]

    }

d=pd.DataFrame(df)
#d.iloc[:,0]#(only fethched coloumn at zero index)
#d.iloc[:,[1,4]]#(fetched first and fourth coloumn)
#d.iloc[[1,3]#(fetches the all values of 1 and 3)
#d.iloc[1,[0,2]]#(FETCHES THE  1 VALUE FROM THE 0 AND 2 COLOUMN)


d[d["age"]>=22].iloc[:,:]#(FETHES THE CONDITION APPLIED ON ALL COLOUMNS AND ALL ROWS )

      name  age  exp     post  salary
0  harshit   22    1    clerk   20000
1     hari   23    2    clerk   25000
2    rahul   24    3  cashier   30000

In [43]:
import pandas as pd
df={
    
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'exp':[1,2,3,4],
        'post':["clerk","clerk","cashier","hr"],
        'salary':[20000,25000,30000,35000]

    }

d=pd.DataFrame(df)
d.iloc[3]

name       riya
age          21
exp           4
post         hr
salary    35000
Name: 3, dtype: object

In [44]:
import pandas as pd
df={
    
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'exp':[1,2,3,4],
        'post':["clerk","clerk","cashier","hr"],
        'salary':[20000,25000,30000,35000]

    }

d=pd.DataFrame(df)
d.

SyntaxError: invalid syntax (3327923219.py, line 13)

In [ ]:
import pandas as pd
df=pd.DataFrame(


    {

        "name":["a","b","c","d"],
        "id":[5,6,2,3]
        
    }
)

df1=pd.DataFrame(
    {
        "dept":["it","sales","ai","ds"],
        "id":[1,9,5,6]
    }
)
# d=pd.merge(df,df1,on='id',how='inner')
#d=pd.merge(df,df1,on='id',how='left')
#d=pd.merge(df,df1,on='id',how='right')
d=pd.merge(df,df1,on='id',how='outer')
d

  name  id   dept
0  NaN   1     it
1    c   2    NaN
2    d   3    NaN
3    a   5     ai
4    b   6     ds
5  NaN   9  sales

In [ ]:
import pandas as pd
df=pd.DataFrame(


    {

        "name":["a","b","c","d"],
        "id":[5,6,2,3]
        
    }
)

df1=pd.DataFrame(
    {
        "dept":["it","sales","ai","ds"],
        "user_id":[1,9,5,6]
    }
)
d=pd.merge(df,df1,left_on='id',right_on='user_id',how='inner')
d

  name  id dept  user_id
0    a   5   ai        5
1    b   6   ds        6

In [ ]:
import pandas as pd
df=pd.DataFrame(


    {

        "name":["a","b","c","d"],
        "id":[5,6,2,3]
        
    }
)

d=df.sort_values(by=["id"],ascending=True)
d

  name  id
2    c   2
3    d   3
0    a   5
1    b   6

In [ ]:
import pandas as pd
df=pd.DataFrame(


    {

        "name":["a","b","c","d"],
        "id":[5,6,2,3]
        
    }
)

d=df.sort_values(by=["id"],ascending=False)
d

  name  id
1    b   6
0    a   5
3    d   3
2    c   2

In [ ]:
import pandas as pd
df=pd.DataFrame(


    {

        "name":['sheela',"harry","hari","raavi"],
        "id":[5,6,2,3]
        
    }
)

d=df.sort_values(by=["name"],ascending=True)
d

     name  id
2    hari   2
1   harry   6
3   raavi   3
0  sheela   5

In [ ]:
import pandas as pd
df=pd.DataFrame(
    {
        "company_name":["google","tcs","techcadd","infosys"],
        "employee_name":["ram","hari","harshit","raavi"]
        "employee_id":['f6',"7d","9u","8t"]
        "employee_post":["ceo","hr","manager","clerk"]
        "employee_salary":[]


    }
)

In [ ]:
import pandas as pd
d=pd.DataFrame(
    {
        "emp_id":[101,102,103,104,105],
        "name":['rahul',"anita","amit","neha","rohit"],
        "department":["it",'hr',"it","finance","hr"],
        "salary":[50000,45000,60000,55000,48000],
        "experience":[2,3,5,4,2]
    }
)
# print(d,"\n")
# q=d.iloc[:,[1,3]]
# print(q,"\n")
# w=d.iloc[0:3]
# print(w,'\n')
# e=d[d["department"]=="it"]
# print(e,"\n")
# r=d[d["salary"]>50000]
# print(r,"\n")
# d["bonus"]=d.loc[(d["experience"]>0),"salary"]*0.10
# print(d)
# y=d.agg({"name",["salary"]:"max"})
# print(y)
# u=d.sort_values(by=["salary"],ascending=True)
# print(u)
# d["new_salary"]=d.loc[(d["experience"]>=3),"salary"]+5000
# print(d)
# i=d["department"].value_counts()
# print(i)
o=d.rename(
    columns={
        "salary":"paycheck"
    }
)
print(o)

   emp_id   name department  paycheck  experience
0     101  rahul         it     50000           2
1     102  anita         hr     45000           3
2     103   amit         it     60000           5
3     104   neha    finance     55000           4
4     105  rohit         hr     48000           2

In [ ]:
data2=data[(data['Experience_Years']>5) & (data['Department']=='IT')]
data2

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary
2,3,Employee_3,IT,12,High School,51,Female,Hyderabad,69064
6,7,Employee_7,IT,14,PhD,57,Male,Mumbai,70525
7,8,Employee_8,IT,17,PhD,34,Female,Bangalore,44830
25,26,Employee_26,IT,14,Master,24,Male,Hyderabad,30600
26,27,Employee_27,IT,8,Bachelor,27,Female,Delhi,119660
30,31,Employee_31,IT,15,Bachelor,54,Female,Hyderabad,70714
34,35,Employee_35,IT,13,Master,53,Male,Bangalore,130983
36,37,Employee_37,IT,7,High School,33,Male,Chennai,81491

In [ ]:
data2['Gender']=data['Gender'].replace({
    'Male':'m',
    'Female':'f'
})
data2

C:\Users\TECHCADD\AppData\Local\Temp\ipykernel_10648\1819960806.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data2['Gender']=data['Gender'].replace({

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary
2,3,Employee_3,IT,12,High School,51,f,Hyderabad,69064
6,7,Employee_7,IT,14,PhD,57,m,Mumbai,70525
7,8,Employee_8,IT,17,PhD,34,f,Bangalore,44830
25,26,Employee_26,IT,14,Master,24,m,Hyderabad,30600
26,27,Employee_27,IT,8,Bachelor,27,f,Delhi,119660
30,31,Employee_31,IT,15,Bachelor,54,f,Hyderabad,70714
34,35,Employee_35,IT,13,Master,53,m,Bangalore,130983
36,37,Employee_37,IT,7,High School,33,m,Chennai,81491

In [ ]:
d=pd.read_csv(r"c:\Users\TECHCADD\Downloads\employee_salary_dataset.csv")
d

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary
0,1,Employee_1,Marketing,15,Master,53,Female,Delhi,111416
1,2,Employee_2,Operations,7,Bachelor,25,Female,Bangalore,95271
2,3,Employee_3,IT,12,High School,51,Female,Hyderabad,69064
3,4,Employee_4,Operations,8,PhD,44,Male,Delhi,95091
4,5,Employee_5,Operations,15,Master,36,Female,Delhi,132450
5,6,Employee_6,Finance,3,High School,50,Male,Mumbai,65818
6,7,Employee_7,IT,14,PhD,57,Male,Mumbai,70525
7,8,Employee_8,IT,17,PhD,34,Female,Bangalore,44830
8,9,Employee_9,IT,4,Bachelor,53,Male,Hyderabad,42429
9,10,Employee_10,Operations,18,High School,28,Male,Mumbai,31893
10,11,Employee_11,Marketing,8,PhD,43,Male,Delhi,141381
11,12,Employee_12,IT,4,Master,49,Female,Hyderabad,104909
12,13,Employee_13,Operations,2,Master,23,Female,Hyderabad,72333
13,14,Employee_14,Finance,6,Bachelor,27,Male,Delhi,28436
14,15,Employee_15,Marketing,10,PhD,49,Female,Mumbai,99290
15,16,Employee_16,Finance,4,High School,49,Female,Delhi,101213
16,17,Employee_17,Marketing,18,Master,41,Female,Hyderabad,30895
17,18,Employee_18,Operations,12,PhD,51,Female,Chennai,44738
18,19,Employee_19,HR,2,PhD,32,Male,Chennai,55746
19,20,Employee_20,Marketing,10,Bachelor,49,Male,Bangalore,74377
20,21,Employee_21,Finance,4,Master,46,Female,Delhi,73404
21,22,Employee_22,Operations,14,Master,54,Female,Delhi,79045
22,23,Employee_23,Marketing,16,High School,22,Male,Bangalore,122888
23,24,Employee_24,HR,15,Master,48,Male,Bangalore,64790
24,25,Employee_25,HR,8,High School,34,Female,Bangalore,132455
25,26,Employee_26,IT,14,Master,24,Male,Hyderabad,30600
26,27,Employee_27,IT,8,Bachelor,27,Female,Delhi,119660
27,28,Employee_28,Finance,16,Master,29,Female,Hyderabad,118179
28,29,Employee_29,Marketing,13,High School,48,Male,Bangalore,65764
29,30,Employee_30,Marketing,18,High School,30,Male,Delhi,99543
30,31,Employee_31,IT,15,Bachelor,54,Female,Hyderabad,70714
31,32,Employee_32,Marketing,13,Master,45,Female,Hyderabad,81835
32,33,Employee_33,Marketing,9,Master,36,Male,Bangalore,127946
33,34,Employee_34,HR,15,Bachelor,53,Female,Delhi,134616
34,35,Employee_35,IT,13,Master,53,Male,Bangalore,130983
35,36,Employee_36,Operations,1,Master,45,Female,Delhi,98744
36,37,Employee_37,IT,7,High School,33,Male,Chennai,81491
37,38,Employee_38,Operations,9,Master,23,Male,Mumbai,149123
38,39,Employee_39,HR,1,Master,24,Male,Mumbai,43589
39,40,Employee_40,Finance,12,Bachelor,38,Female,Mumbai,68484
40,41,Employee_41,Marketing,8,Bachelor,23,Female,Bangalore,107989
41,42,Employee_42,HR,11,PhD,23,Male,Chennai,61212
42,43,Employee_43,Marketing,19,High School,49,Female,Delhi,68525
43,44,Employee_44,Finance,17,Master,44,Male,Hyderabad,72202
44,45,Employee_45,Finance,8,Master,53,Male,Delhi,57635
45,46,Employee_46,HR,3,PhD,54,Female,Hyderabad,88208
46,47,Employee_47,Finance,3,Master,22,Female,Delhi,58828
47,48,Employee_48,Operations,1,High School,40,Male,Chennai,43711
48,49,Employee_49,Finance,5,PhD,23,Female,Hyderabad,28420
49,50,Employee_50,Marketing,10,High School,47,Female,Bangalore,121752

In [ ]:
q=d[(d["Experience_Years"]<5) & (d["Age"]<35)]
q

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary
12,13,Employee_13,Operations,2,Master,23,Female,Hyderabad,72333
18,19,Employee_19,HR,2,PhD,32,Male,Chennai,55746
38,39,Employee_39,HR,1,Master,24,Male,Mumbai,43589
46,47,Employee_47,Finance,3,Master,22,Female,Delhi,58828

In [ ]:
q["City"]=q["City"].replace({
    "Hyderabad":"Maharashtra",
    "Delhi":"kolkata"
}
)
q

C:\Users\TECHCADD\AppData\Local\Temp\ipykernel_10648\3748495217.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  q["City"]=q["City"].replace({

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary
12,13,Employee_13,Operations,2,Master,23,Female,Maharashtra,72333
18,19,Employee_19,HR,2,PhD,32,Male,Chennai,55746
38,39,Employee_39,HR,1,Master,24,Male,Mumbai,43589
46,47,Employee_47,Finance,3,Master,22,Female,kolkata,58828

In [ ]:
data=pd.read_csv(r'c:\Users\TECHCADD\Downloads\employee_data.csv')
data

,EmpID,FirstName,LastName,StartDate,ExitDate,Title,Supervisor,ADEmail,BusinessUnit,EmployeeStatus,...,Division,DOB,State,JobFunctionDescription,GenderCode,LocationCode,RaceDesc,MaritalDesc,Performance Score,Current Employee Rating
0,3427,Uriah,Bridges,20-Sep-19,NaN,Production Technician I,Peter Oneill,uriah.bridges@bilearner.com,CCDR,Active,...,Finance & Accounting,07-10-1969,MA,Accounting,Female,34904,White,Widowed,Fully Meets,4
1,3428,Paula,Small,11-Feb-23,NaN,Production Technician I,Renee Mccormick,paula.small@bilearner.com,EW,Active,...,Aerial,30-08-1965,MA,Labor,Male,6593,Hispanic,Widowed,Fully Meets,3
2,3429,Edward,Buck,10-Dec-18,NaN,Area Sales Manager,Crystal Walker,edward.buck@bilearner.com,PL,Active,...,General - Sga,06-10-1991,MA,Assistant,Male,2330,Hispanic,Widowed,Fully Meets,4
3,3430,Michael,Riordan,21-Jun-21,NaN,Area Sales Manager,Rebekah Wright,michael.riordan@bilearner.com,CCDR,Active,...,Finance & Accounting,04-04-1998,ND,Clerk,Male,58782,Other,Single,Fully Meets,2
4,3431,Jasmine,Onque,29-Jun-19,NaN,Area Sales Manager,Jason Kim,jasmine.onque@bilearner.com,TNS,Active,...,General - Con,29-08-1969,FL,Laborer,Female,33174,Other,Married,Fully Meets,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2995,3422,Jakobe,Erickson,22-Jun-22,07-Aug-22,Production Technician I,Bethany Carter,jakobe.erickson@bilearner.com,PYZ,Leave of Absence,...,Engineers,23-06-1998,MA,Model Assistant,Female,44500,Other,Widowed,Fully Meets,3
2996,3423,Adyson,Strickland,28-Dec-20,NaN,Production Technician I,Caroline Harris,adyson.strickland@bilearner.com,SVG,Active,...,Engineers,10-06-2001,MA,Engineer,Male,35444,Black,Widowed,Fully Meets,3
2997,3424,Annabel,Wilkins,09-Dec-20,04-Aug-22,Production Technician I,Mr. James Castillo,annabel.wilkins@bilearner.com,TNS,Voluntarily Terminated,...,Wireline Construction,27-01-1997,MA,Laborer,Male,6608,White,Single,Fully Meets,2
2998,3425,Kendra,Braun,28-May-19,23-Oct-21,Production Technician I,Michael Woods,kendra.braun@bilearner.com,WBL,Voluntarily Terminated,...,Aerial,28-05-1954,MA,Foreman,Female,3807,Hispanic,Divorced,Fully Meets,2
2999,3426,Chace,Kerr,27-Apr-22,NaN,Production Technician I,Javier Mccall,chace.kerr@bilearner.com,BPC,Active,...,Field Operations,11-09-1990,MA,Warehouse Technician,Female,57487,White,Married,Fully Meets,2

In [ ]:
data['StartDate']=pd.to_datetime(data['StartDate'])
data['weekday']=data['StartDate'].dt.weekday
data["weekday"]=data["weekday"].replace({
    0:"sunday",
    1:"monday",
    2:"tuesday",
    3:"wednesday",
    4:"thursday",
    5:"friday",
    6:"saturday"

})
data

,EmpID,FirstName,LastName,StartDate,ExitDate,Title,Supervisor,ADEmail,BusinessUnit,EmployeeStatus,...,State,JobFunctionDescription,GenderCode,LocationCode,RaceDesc,MaritalDesc,Performance Score,Current Employee Rating,month,weekday
0,3427,Uriah,Bridges,2019-09-20,NaN,Production Technician I,Peter Oneill,uriah.bridges@bilearner.com,CCDR,Active,...,MA,Accounting,Female,34904,White,Widowed,Fully Meets,4,4,thursday
1,3428,Paula,Small,2023-02-11,NaN,Production Technician I,Renee Mccormick,paula.small@bilearner.com,EW,Active,...,MA,Labor,Male,6593,Hispanic,Widowed,Fully Meets,3,5,friday
2,3429,Edward,Buck,2018-12-10,NaN,Area Sales Manager,Crystal Walker,edward.buck@bilearner.com,PL,Active,...,MA,Assistant,Male,2330,Hispanic,Widowed,Fully Meets,4,0,sunday
3,3430,Michael,Riordan,2021-06-21,NaN,Area Sales Manager,Rebekah Wright,michael.riordan@bilearner.com,CCDR,Active,...,ND,Clerk,Male,58782,Other,Single,Fully Meets,2,0,sunday
4,3431,Jasmine,Onque,2019-06-29,NaN,Area Sales Manager,Jason Kim,jasmine.onque@bilearner.com,TNS,Active,...,FL,Laborer,Female,33174,Other,Married,Fully Meets,3,5,friday
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2995,3422,Jakobe,Erickson,2022-06-22,07-Aug-22,Production Technician I,Bethany Carter,jakobe.erickson@bilearner.com,PYZ,Leave of Absence,...,MA,Model Assistant,Female,44500,Other,Widowed,Fully Meets,3,2,tuesday
2996,3423,Adyson,Strickland,2020-12-28,NaN,Production Technician I,Caroline Harris,adyson.strickland@bilearner.com,SVG,Active,...,MA,Engineer,Male,35444,Black,Widowed,Fully Meets,3,0,sunday
2997,3424,Annabel,Wilkins,2020-12-09,04-Aug-22,Production Technician I,Mr. James Castillo,annabel.wilkins@bilearner.com,TNS,Voluntarily Terminated,...,MA,Laborer,Male,6608,White,Single,Fully Meets,2,2,tuesday
2998,3425,Kendra,Braun,2019-05-28,23-Oct-21,Production Technician I,Michael Woods,kendra.braun@bilearner.com,WBL,Voluntarily Terminated,...,MA,Foreman,Female,3807,Hispanic,Divorced,Fully Meets,2,1,monday
2999,3426,Chace,Kerr,2022-04-27,NaN,Production Technician I,Javier Mccall,chace.kerr@bilearner.com,BPC,Active,...,MA,Warehouse Technician,Female,57487,White,Married,Fully Meets,2,2,tuesday

In [ ]:
d=pd.read_csv(r"c:\Users\TECHCADD\Downloads\employee_salary_dataset.csv")
d

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary
0,1,Employee_1,Marketing,15,Master,53,Female,Delhi,111416
1,2,Employee_2,Operations,7,Bachelor,25,Female,Bangalore,95271
2,3,Employee_3,IT,12,High School,51,Female,Hyderabad,69064
3,4,Employee_4,Operations,8,PhD,44,Male,Delhi,95091
4,5,Employee_5,Operations,15,Master,36,Female,Delhi,132450
5,6,Employee_6,Finance,3,High School,50,Male,Mumbai,65818
6,7,Employee_7,IT,14,PhD,57,Male,Mumbai,70525
7,8,Employee_8,IT,17,PhD,34,Female,Bangalore,44830
8,9,Employee_9,IT,4,Bachelor,53,Male,Hyderabad,42429
9,10,Employee_10,Operations,18,High School,28,Male,Mumbai,31893
10,11,Employee_11,Marketing,8,PhD,43,Male,Delhi,141381
11,12,Employee_12,IT,4,Master,49,Female,Hyderabad,104909
12,13,Employee_13,Operations,2,Master,23,Female,Hyderabad,72333
13,14,Employee_14,Finance,6,Bachelor,27,Male,Delhi,28436
14,15,Employee_15,Marketing,10,PhD,49,Female,Mumbai,99290
15,16,Employee_16,Finance,4,High School,49,Female,Delhi,101213
16,17,Employee_17,Marketing,18,Master,41,Female,Hyderabad,30895
17,18,Employee_18,Operations,12,PhD,51,Female,Chennai,44738
18,19,Employee_19,HR,2,PhD,32,Male,Chennai,55746
19,20,Employee_20,Marketing,10,Bachelor,49,Male,Bangalore,74377
20,21,Employee_21,Finance,4,Master,46,Female,Delhi,73404
21,22,Employee_22,Operations,14,Master,54,Female,Delhi,79045
22,23,Employee_23,Marketing,16,High School,22,Male,Bangalore,122888
23,24,Employee_24,HR,15,Master,48,Male,Bangalore,64790
24,25,Employee_25,HR,8,High School,34,Female,Bangalore,132455
25,26,Employee_26,IT,14,Master,24,Male,Hyderabad,30600
26,27,Employee_27,IT,8,Bachelor,27,Female,Delhi,119660
27,28,Employee_28,Finance,16,Master,29,Female,Hyderabad,118179
28,29,Employee_29,Marketing,13,High School,48,Male,Bangalore,65764
29,30,Employee_30,Marketing,18,High School,30,Male,Delhi,99543
30,31,Employee_31,IT,15,Bachelor,54,Female,Hyderabad,70714
31,32,Employee_32,Marketing,13,Master,45,Female,Hyderabad,81835
32,33,Employee_33,Marketing,9,Master,36,Male,Bangalore,127946
33,34,Employee_34,HR,15,Bachelor,53,Female,Delhi,134616
34,35,Employee_35,IT,13,Master,53,Male,Bangalore,130983
35,36,Employee_36,Operations,1,Master,45,Female,Delhi,98744
36,37,Employee_37,IT,7,High School,33,Male,Chennai,81491
37,38,Employee_38,Operations,9,Master,23,Male,Mumbai,149123
38,39,Employee_39,HR,1,Master,24,Male,Mumbai,43589
39,40,Employee_40,Finance,12,Bachelor,38,Female,Mumbai,68484
40,41,Employee_41,Marketing,8,Bachelor,23,Female,Bangalore,107989
41,42,Employee_42,HR,11,PhD,23,Male,Chennai,61212
42,43,Employee_43,Marketing,19,High School,49,Female,Delhi,68525
43,44,Employee_44,Finance,17,Master,44,Male,Hyderabad,72202
44,45,Employee_45,Finance,8,Master,53,Male,Delhi,57635
45,46,Employee_46,HR,3,PhD,54,Female,Hyderabad,88208
46,47,Employee_47,Finance,3,Master,22,Female,Delhi,58828
47,48,Employee_48,Operations,1,High School,40,Male,Chennai,43711
48,49,Employee_49,Finance,5,PhD,23,Female,Hyderabad,28420
49,50,Employee_50,Marketing,10,High School,47,Female,Bangalore,121752

In [ ]:
import numpy as np

np.int64(0)

In [ ]:
q=[d['Experience_Years']<=3,(d['Experience_Years']>3)&( d['Experience_Years']<=7),d["Experience_Years"]>7]
choice=['low','average','high']
d['status']=np.select(q,choice,default='unknown')
d

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary,status
0,1,Employee_1,Marketing,15,Master,53,Female,Delhi,111416,high
1,2,Employee_2,Operations,7,Bachelor,25,Female,Bangalore,95271,average
2,3,Employee_3,IT,12,High School,51,Female,Hyderabad,69064,high
3,4,Employee_4,Operations,8,PhD,44,Male,Delhi,95091,high
4,5,Employee_5,Operations,15,Master,36,Female,Delhi,132450,high
5,6,Employee_6,Finance,3,High School,50,Male,Mumbai,65818,low
6,7,Employee_7,IT,14,PhD,57,Male,Mumbai,70525,high
7,8,Employee_8,IT,17,PhD,34,Female,Bangalore,44830,high
8,9,Employee_9,IT,4,Bachelor,53,Male,Hyderabad,42429,average
9,10,Employee_10,Operations,18,High School,28,Male,Mumbai,31893,high
10,11,Employee_11,Marketing,8,PhD,43,Male,Delhi,141381,high
11,12,Employee_12,IT,4,Master,49,Female,Hyderabad,104909,average
12,13,Employee_13,Operations,2,Master,23,Female,Hyderabad,72333,low
13,14,Employee_14,Finance,6,Bachelor,27,Male,Delhi,28436,average
14,15,Employee_15,Marketing,10,PhD,49,Female,Mumbai,99290,high
15,16,Employee_16,Finance,4,High School,49,Female,Delhi,101213,average
16,17,Employee_17,Marketing,18,Master,41,Female,Hyderabad,30895,high
17,18,Employee_18,Operations,12,PhD,51,Female,Chennai,44738,high
18,19,Employee_19,HR,2,PhD,32,Male,Chennai,55746,low
19,20,Employee_20,Marketing,10,Bachelor,49,Male,Bangalore,74377,high
20,21,Employee_21,Finance,4,Master,46,Female,Delhi,73404,average
21,22,Employee_22,Operations,14,Master,54,Female,Delhi,79045,high
22,23,Employee_23,Marketing,16,High School,22,Male,Bangalore,122888,high
23,24,Employee_24,HR,15,Master,48,Male,Bangalore,64790,high
24,25,Employee_25,HR,8,High School,34,Female,Bangalore,132455,high
25,26,Employee_26,IT,14,Master,24,Male,Hyderabad,30600,high
26,27,Employee_27,IT,8,Bachelor,27,Female,Delhi,119660,high
27,28,Employee_28,Finance,16,Master,29,Female,Hyderabad,118179,high
28,29,Employee_29,Marketing,13,High School,48,Male,Bangalore,65764,high
29,30,Employee_30,Marketing,18,High School,30,Male,Delhi,99543,high
30,31,Employee_31,IT,15,Bachelor,54,Female,Hyderabad,70714,high
31,32,Employee_32,Marketing,13,Master,45,Female,Hyderabad,81835,high
32,33,Employee_33,Marketing,9,Master,36,Male,Bangalore,127946,high
33,34,Employee_34,HR,15,Bachelor,53,Female,Delhi,134616,high
34,35,Employee_35,IT,13,Master,53,Male,Bangalore,130983,high
35,36,Employee_36,Operations,1,Master,45,Female,Delhi,98744,low
36,37,Employee_37,IT,7,High School,33,Male,Chennai,81491,average
37,38,Employee_38,Operations,9,Master,23,Male,Mumbai,149123,high
38,39,Employee_39,HR,1,Master,24,Male,Mumbai,43589,low
39,40,Employee_40,Finance,12,Bachelor,38,Female,Mumbai,68484,high
40,41,Employee_41,Marketing,8,Bachelor,23,Female,Bangalore,107989,high
41,42,Employee_42,HR,11,PhD,23,Male,Chennai,61212,high
42,43,Employee_43,Marketing,19,High School,49,Female,Delhi,68525,high
43,44,Employee_44,Finance,17,Master,44,Male,Hyderabad,72202,high
44,45,Employee_45,Finance,8,Master,53,Male,Delhi,57635,high
45,46,Employee_46,HR,3,PhD,54,Female,Hyderabad,88208,low
46,47,Employee_47,Finance,3,Master,22,Female,Delhi,58828,low
47,48,Employee_48,Operations,1,High School,40,Male,Chennai,43711,low
48,49,Employee_49,Finance,5,PhD,23,Female,Hyderabad,28420,average
49,50,Employee_50,Marketing,10,High School,47,Female,Bangalore,121752,high

In [ ]:
q=[d['Experience_Years']<=5,(d['Experience_Years']>=6)&( d['Experience_Years']<=10),d["Experience_Years"]>10]
choice=['low','mid','high']
d['exp_status']=np.select(q,choice,default='unknown')
d

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary,status,exp_status
0,1,Employee_1,Marketing,15,Master,53,Female,Delhi,111416,unknown,high
1,2,Employee_2,Operations,7,Bachelor,25,Female,Bangalore,95271,unknown,mid
2,3,Employee_3,IT,12,High School,51,Female,Hyderabad,69064,unknown,high
3,4,Employee_4,Operations,8,PhD,44,Male,Delhi,95091,unknown,mid
4,5,Employee_5,Operations,15,Master,36,Female,Delhi,132450,unknown,high
5,6,Employee_6,Finance,3,High School,50,Male,Mumbai,65818,unknown,low
6,7,Employee_7,IT,14,PhD,57,Male,Mumbai,70525,unknown,high
7,8,Employee_8,IT,17,PhD,34,Female,Bangalore,44830,unknown,high
8,9,Employee_9,IT,4,Bachelor,53,Male,Hyderabad,42429,unknown,low
9,10,Employee_10,Operations,18,High School,28,Male,Mumbai,31893,unknown,high
10,11,Employee_11,Marketing,8,PhD,43,Male,Delhi,141381,unknown,mid
11,12,Employee_12,IT,4,Master,49,Female,Hyderabad,104909,unknown,low
12,13,Employee_13,Operations,2,Master,23,Female,Hyderabad,72333,unknown,low
13,14,Employee_14,Finance,6,Bachelor,27,Male,Delhi,28436,unknown,mid
14,15,Employee_15,Marketing,10,PhD,49,Female,Mumbai,99290,unknown,mid
15,16,Employee_16,Finance,4,High School,49,Female,Delhi,101213,unknown,low
16,17,Employee_17,Marketing,18,Master,41,Female,Hyderabad,30895,unknown,high
17,18,Employee_18,Operations,12,PhD,51,Female,Chennai,44738,unknown,high
18,19,Employee_19,HR,2,PhD,32,Male,Chennai,55746,unknown,low
19,20,Employee_20,Marketing,10,Bachelor,49,Male,Bangalore,74377,unknown,mid
20,21,Employee_21,Finance,4,Master,46,Female,Delhi,73404,unknown,low
21,22,Employee_22,Operations,14,Master,54,Female,Delhi,79045,unknown,high
22,23,Employee_23,Marketing,16,High School,22,Male,Bangalore,122888,unknown,high
23,24,Employee_24,HR,15,Master,48,Male,Bangalore,64790,unknown,high
24,25,Employee_25,HR,8,High School,34,Female,Bangalore,132455,unknown,mid
25,26,Employee_26,IT,14,Master,24,Male,Hyderabad,30600,unknown,high
26,27,Employee_27,IT,8,Bachelor,27,Female,Delhi,119660,unknown,mid
27,28,Employee_28,Finance,16,Master,29,Female,Hyderabad,118179,unknown,high
28,29,Employee_29,Marketing,13,High School,48,Male,Bangalore,65764,unknown,high
29,30,Employee_30,Marketing,18,High School,30,Male,Delhi,99543,unknown,high
30,31,Employee_31,IT,15,Bachelor,54,Female,Hyderabad,70714,unknown,high
31,32,Employee_32,Marketing,13,Master,45,Female,Hyderabad,81835,unknown,high
32,33,Employee_33,Marketing,9,Master,36,Male,Bangalore,127946,unknown,mid
33,34,Employee_34,HR,15,Bachelor,53,Female,Delhi,134616,unknown,high
34,35,Employee_35,IT,13,Master,53,Male,Bangalore,130983,unknown,high
35,36,Employee_36,Operations,1,Master,45,Female,Delhi,98744,unknown,low
36,37,Employee_37,IT,7,High School,33,Male,Chennai,81491,unknown,mid
37,38,Employee_38,Operations,9,Master,23,Male,Mumbai,149123,unknown,mid
38,39,Employee_39,HR,1,Master,24,Male,Mumbai,43589,unknown,low
39,40,Employee_40,Finance,12,Bachelor,38,Female,Mumbai,68484,unknown,high
40,41,Employee_41,Marketing,8,Bachelor,23,Female,Bangalore,107989,unknown,mid
41,42,Employee_42,HR,11,PhD,23,Male,Chennai,61212,unknown,high
42,43,Employee_43,Marketing,19,High School,49,Female,Delhi,68525,unknown,high
43,44,Employee_44,Finance,17,Master,44,Male,Hyderabad,72202,unknown,high
44,45,Employee_45,Finance,8,Master,53,Male,Delhi,57635,unknown,mid
45,46,Employee_46,HR,3,PhD,54,Female,Hyderabad,88208,unknown,low
46,47,Employee_47,Finance,3,Master,22,Female,Delhi,58828,unknown,low
47,48,Employee_48,Operations,1,High School,40,Male,Chennai,43711,unknown,low
48,49,Employee_49,Finance,5,PhD,23,Female,Hyderabad,28420,unknown,low
49,50,Employee_50,Marketing,10,High School,47,Female,Bangalore,121752,unknown,mid

In [42]:
import pandas as pd

d=pd.DataFrame(
    {
    "region":["north","east","east","south","west","north","south",'east'],
    'product':['a','b','c','d','e','f','g','h'],
    'sales':[200,150,50,80,180,100,250,140],
    'profit':[20,15,50,40,35,30,45,60]

    }
)
# d.groupby('region')[['sales','profit']].sum()
# d.groupby(['region','product'])[['sales','profit']].sum()
# d.groupby(['region','product'])[['profit']].sum()
# d.groupby(['region','product'])[['profit']].agg(['min',"max",'mean'])
#d.groupby('region').agg({'sales':'sum','profit':'mean'})
rr=d.groupby('region')[["sales","profit"]].sum()
rr=rr[rr['sales']>300]
rr
#d.groupby('region')['product'].count()
# q=d.pivot(index="region",coloumns="product",values="sales")
# q

        sales  profit
region
east      340     125
south     330      85

In [46]:
d=pd.read_csv(r"c:\Users\TECHCADD\Downloads\employee_salary_dataset.csv")
d

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary
0,1,Employee_1,Marketing,15,Master,53,Female,Delhi,111416
1,2,Employee_2,Operations,7,Bachelor,25,Female,Bangalore,95271
2,3,Employee_3,IT,12,High School,51,Female,Hyderabad,69064
3,4,Employee_4,Operations,8,PhD,44,Male,Delhi,95091
4,5,Employee_5,Operations,15,Master,36,Female,Delhi,132450
5,6,Employee_6,Finance,3,High School,50,Male,Mumbai,65818
6,7,Employee_7,IT,14,PhD,57,Male,Mumbai,70525
7,8,Employee_8,IT,17,PhD,34,Female,Bangalore,44830
8,9,Employee_9,IT,4,Bachelor,53,Male,Hyderabad,42429
9,10,Employee_10,Operations,18,High School,28,Male,Mumbai,31893
10,11,Employee_11,Marketing,8,PhD,43,Male,Delhi,141381
11,12,Employee_12,IT,4,Master,49,Female,Hyderabad,104909
12,13,Employee_13,Operations,2,Master,23,Female,Hyderabad,72333
13,14,Employee_14,Finance,6,Bachelor,27,Male,Delhi,28436
14,15,Employee_15,Marketing,10,PhD,49,Female,Mumbai,99290
15,16,Employee_16,Finance,4,High School,49,Female,Delhi,101213
16,17,Employee_17,Marketing,18,Master,41,Female,Hyderabad,30895
17,18,Employee_18,Operations,12,PhD,51,Female,Chennai,44738
18,19,Employee_19,HR,2,PhD,32,Male,Chennai,55746
19,20,Employee_20,Marketing,10,Bachelor,49,Male,Bangalore,74377
20,21,Employee_21,Finance,4,Master,46,Female,Delhi,73404
21,22,Employee_22,Operations,14,Master,54,Female,Delhi,79045
22,23,Employee_23,Marketing,16,High School,22,Male,Bangalore,122888
23,24,Employee_24,HR,15,Master,48,Male,Bangalore,64790
24,25,Employee_25,HR,8,High School,34,Female,Bangalore,132455
25,26,Employee_26,IT,14,Master,24,Male,Hyderabad,30600
26,27,Employee_27,IT,8,Bachelor,27,Female,Delhi,119660
27,28,Employee_28,Finance,16,Master,29,Female,Hyderabad,118179
28,29,Employee_29,Marketing,13,High School,48,Male,Bangalore,65764
29,30,Employee_30,Marketing,18,High School,30,Male,Delhi,99543
30,31,Employee_31,IT,15,Bachelor,54,Female,Hyderabad,70714
31,32,Employee_32,Marketing,13,Master,45,Female,Hyderabad,81835
32,33,Employee_33,Marketing,9,Master,36,Male,Bangalore,127946
33,34,Employee_34,HR,15,Bachelor,53,Female,Delhi,134616
34,35,Employee_35,IT,13,Master,53,Male,Bangalore,130983
35,36,Employee_36,Operations,1,Master,45,Female,Delhi,98744
36,37,Employee_37,IT,7,High School,33,Male,Chennai,81491
37,38,Employee_38,Operations,9,Master,23,Male,Mumbai,149123
38,39,Employee_39,HR,1,Master,24,Male,Mumbai,43589
39,40,Employee_40,Finance,12,Bachelor,38,Female,Mumbai,68484
40,41,Employee_41,Marketing,8,Bachelor,23,Female,Bangalore,107989
41,42,Employee_42,HR,11,PhD,23,Male,Chennai,61212
42,43,Employee_43,Marketing,19,High School,49,Female,Delhi,68525
43,44,Employee_44,Finance,17,Master,44,Male,Hyderabad,72202
44,45,Employee_45,Finance,8,Master,53,Male,Delhi,57635
45,46,Employee_46,HR,3,PhD,54,Female,Hyderabad,88208
46,47,Employee_47,Finance,3,Master,22,Female,Delhi,58828
47,48,Employee_48,Operations,1,High School,40,Male,Chennai,43711
48,49,Employee_49,Finance,5,PhD,23,Female,Hyderabad,28420
49,50,Employee_50,Marketing,10,High School,47,Female,Bangalore,121752

In [47]:
data=d.groupby('Department')['Monthly_Salary'].mean()
data

Department
Finance       67261.900000
HR            82945.142857
IT            76520.500000
Marketing     96430.846154
Operations    84239.900000
Name: Monthly_Salary, dtype: float64

In [2]:
import pandas as pd
data=pd.read_csv(r'C:\Users\TECHCADD\Desktop\harshit\data\travis_scott_clean.csv')
data

,track_id,track_name,album_id,album_name,release_date,artists,is_travis_main,track_number,duration_ms,explicit,duration_seconds,popularity
0,69cLn7zwq2oIfnahAOIwV1,JB2 RADIO,32lGAqeVkdJxEj2iv2Q01B,JACKBOYS 2,2025-07-13,JACKBOYS,False,1,31507,True,31.51,53
1,5wNIHa6wvCCKP6fWgo3UAh,CHAMPAIN & VACAY,32lGAqeVkdJxEj2iv2Q01B,JACKBOYS 2,2025-07-13,"Travis Scott, Don Toliver",True,2,184789,True,184.79,72
2,6Gp3pYkydEOkl8EHHJxa9s,2000 EXCURSION,32lGAqeVkdJxEj2iv2Q01B,JACKBOYS 2,2025-07-13,"Travis Scott, Sheck Wes, Don Toliver",True,3,222986,True,222.99,67
3,5P03xImM2uFukzoty7NDw7,KICK OUT,32lGAqeVkdJxEj2iv2Q01B,JACKBOYS 2,2025-07-13,Travis Scott,True,4,170498,True,170.50,74
4,1rQEgtQNsj63xIUzEmKbML,DUMBO,32lGAqeVkdJxEj2iv2Q01B,JACKBOYS 2,2025-07-13,Travis Scott,True,5,238249,True,238.25,74
...,...,...,...,...,...,...,...,...,...,...,...,...
110,1OLABkcTvWfXE2xs5Yb2Ex,Sloppy Toppy (feat. Migos & Peewee Longway),54Y471E7GNBSOXjZtqONId,DAYS BEFORE RODEO,2014-08-18,"Travis Scott, Migos, Peewee Longway",True,8,274207,True,274.21,55
111,0I3MkBTrKeKulwuSSLEJGN,Basement Freestyle,54Y471E7GNBSOXjZtqONId,DAYS BEFORE RODEO,2014-08-18,Travis Scott,True,9,244020,True,244.02,54
112,3cM1GiA3OqESGO5zEZATAP,Backyard,54Y471E7GNBSOXjZtqONId,DAYS BEFORE RODEO,2014-08-18,Travis Scott,True,10,270441,True,270.44,61
113,2UICNcwQNzeuirpkWIaRuF,Grey,54Y471E7GNBSOXjZtqONId,DAYS BEFORE RODEO,2014-08-18,Travis Scott,True,11,219916,True,219.92,56
114,78fsyPMBiIMOXdBnDcBi7z,BACC (Bonus),54Y471E7GNBSOXjZtqONId,DAYS BEFORE RODEO,2014-08-18,Travis Scott,True,12,130681,True,130.68,51

In [ ]:
d=pd.DataFrame(
    {
    "region":["north","east","east","south","west","north","south",'east'],
    'product':['a','b','c','d','e','f','g','h'],
    'sales':[200,150,50,80,180,100,250,140],
    'profit':[20,15,50,40,35,30,45,60]

    }
)

d.rename(columns=str.upper)

  REGION PRODUCT  SALES  PROFIT
0  north       a    200      20
1   east       b    150      15
2   east       c     50      50
3  south       d     80      40
4   west       e    180      35
5  north       f    100      30
6  south       g    250      45
7   east       h    140      60

In [5]:
d=pd.DataFrame(
    {
    "region":["north","east","east","south","west","north","south",'east'],
    'product':['a','b','c','d','e','f','g','h'],
    'sales':[200,150,50,80,180,100,250,140],
    'profit':[20,15,50,40,35,30,45,60]

    }
)

d['region']=d['region'].str.upper()
d

  region product  sales  profit
0  NORTH       a    200      20
1   EAST       b    150      15
2   EAST       c     50      50
3  SOUTH       d     80      40
4   WEST       e    180      35
5  NORTH       f    100      30
6  SOUTH       g    250      45
7   EAST       h    140      60

In [43]:
d=pd.DataFrame(
    {
    "region":["north","east","east","south","west","north","south",'east'],
    'product':['a','b','c','d','e','f','g','h'],
    'sales':[200,150,50,80,180,100,250,140],
    'profit':[20,15,50,40,35,30,45,60]

    }
)

d.rename(columns=str.upper)

  REGION PRODUCT  SALES  PROFIT
0  north       a    200      20
1   east       b    150      15
2   east       c     50      50
3  south       d     80      40
4   west       e    180      35
5  north       f    100      30
6  south       g    250      45
7   east       h    140      60

In [9]:
d=pd.DataFrame({
    "name":["A",'B','A','B'],
    "product":["mobile","laptop","laptop","mobile"],
    "sales":[20000,30000,25000,15000]

}
)
d

  name product  sales
0    A  mobile  20000
1    B  laptop  30000
2    A  laptop  25000
3    B  mobile  15000

In [15]:
d=pd.DataFrame({
    "name":["A",'B','A','B'],
    "product":["mobile","laptop","laptop","mobile"],
    "sales":[20000,30000,25000,15000]

}
)

pivot=d.pivot_table(index="product",columns="name",values="sales",aggfunc='sum')
pivot

name         A      B
product
laptop   25000  30000
mobile   20000  15000

In [14]:
df=pd.DataFrame(
    {
        'city':['delhi','delhi','mumbai','mumbai','delhi'],
        'item':['pen','pencil','pen','pencil','pen'],
        'quantity':[10,15,20,25,20]
    }
)

dd=df.pivot_table(index='city', columns='item',values='quantity',aggfunc='sum')
dd

item    pen  pencil
city
delhi    30      15
mumbai   20      25

In [ ]:
data=pd.read_csv()
data=pd.read_excel()
d=pd.read_json()

In [47]:
import pandas as pd
data=pd.read_csv(r'C:\Users\TECHCADD\Desktop\harshit\data\travis_scott_clean.csv')
data

,track_id,track_name,album_id,album_name,release_date,artists,is_travis_main,track_number,duration_ms,explicit,duration_seconds,popularity
0,69cLn7zwq2oIfnahAOIwV1,JB2 RADIO,32lGAqeVkdJxEj2iv2Q01B,JACKBOYS 2,2025-07-13,JACKBOYS,False,1,31507,True,31.51,53
1,5wNIHa6wvCCKP6fWgo3UAh,CHAMPAIN & VACAY,32lGAqeVkdJxEj2iv2Q01B,JACKBOYS 2,2025-07-13,"Travis Scott, Don Toliver",True,2,184789,True,184.79,72
2,6Gp3pYkydEOkl8EHHJxa9s,2000 EXCURSION,32lGAqeVkdJxEj2iv2Q01B,JACKBOYS 2,2025-07-13,"Travis Scott, Sheck Wes, Don Toliver",True,3,222986,True,222.99,67
3,5P03xImM2uFukzoty7NDw7,KICK OUT,32lGAqeVkdJxEj2iv2Q01B,JACKBOYS 2,2025-07-13,Travis Scott,True,4,170498,True,170.50,74
4,1rQEgtQNsj63xIUzEmKbML,DUMBO,32lGAqeVkdJxEj2iv2Q01B,JACKBOYS 2,2025-07-13,Travis Scott,True,5,238249,True,238.25,74
...,...,...,...,...,...,...,...,...,...,...,...,...
110,1OLABkcTvWfXE2xs5Yb2Ex,Sloppy Toppy (feat. Migos & Peewee Longway),54Y471E7GNBSOXjZtqONId,DAYS BEFORE RODEO,2014-08-18,"Travis Scott, Migos, Peewee Longway",True,8,274207,True,274.21,55
111,0I3MkBTrKeKulwuSSLEJGN,Basement Freestyle,54Y471E7GNBSOXjZtqONId,DAYS BEFORE RODEO,2014-08-18,Travis Scott,True,9,244020,True,244.02,54
112,3cM1GiA3OqESGO5zEZATAP,Backyard,54Y471E7GNBSOXjZtqONId,DAYS BEFORE RODEO,2014-08-18,Travis Scott,True,10,270441,True,270.44,61
113,2UICNcwQNzeuirpkWIaRuF,Grey,54Y471E7GNBSOXjZtqONId,DAYS BEFORE RODEO,2014-08-18,Travis Scott,True,11,219916,True,219.92,56
114,78fsyPMBiIMOXdBnDcBi7z,BACC (Bonus),54Y471E7GNBSOXjZtqONId,DAYS BEFORE RODEO,2014-08-18,Travis Scott,True,12,130681,True,130.68,51

In [48]:
import pandas as pd
data=pd.read_csv(r'C:\Users\TECHCADD\Desktop\harshit\data\travis_scott_clean.csv')
q=data.pivot_table(index='is_travis_main',columns='album_name',values='duration_ms',aggfunc="mean")
q

album_name,ASTROWORLD,Birds In The Trap Sing McKnight,DAYS BEFORE RODEO,"Huncho Jack, Jack Huncho",JACKBOYS,JACKBOYS 2,Rodeo,UTOPIA
is_travis_main,,,,,,,,
False,NaN,NaN,NaN,NaN,149576.333333,122594.400000,NaN,NaN
True,207191.823529,230370.714286,238428.083333,191829.923077,208467.500000,228101.333333,282940.5625,232462.684211

In [36]:
import pandas as pd
df={
    
        'name':['harshit','hari','rahul','riya'],
        'age':[22,23,24,21],
        'exp':[1,2,3,4],
        'salary':[20000,25000,30000,35000]

    }
d=pd.DataFrame(df)
d
q=d[0:2:]
q

      name  age  exp  salary
0  harshit   22    1   20000
1     hari   23    2   25000